app/controllers/api/v1/authentication_controller.rb

      def login
        p "login"
        @user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "max@email.com"], ["LIMIT", 1]]