app/controllers/api/v1/rankings_controller.rb

SELECT "rankings".* FROM "rankings" WHERE "rankings"."start_date" = $1 ORDER BY "rankings"."id" ASC LIMIT $2  [["start_date", "2023-05-18"], ["LIMIT", 1]]
SELECT "records".* FROM "records" WHERE "records"."ranking_id" = $1  [["ranking_id", 2]]
SELECT "rankings".* FROM "rankings" WHERE "rankings"."start_date" = $1 ORDER BY "rankings"."id" ASC LIMIT $2  [["start_date", "2023-05-17"], ["LIMIT", 1]]
SELECT "records".* FROM "records" WHERE "records"."ranking_id" = $1  [["ranking_id", 1]]
---
      def index
        current_date = Date.today.to_s
        all_records = Ranking.where(start_date: current_date)&.first&.records
        # all_records = Ranking.where(start_date: "2023-05-17")&.first&.records
        array = []
        data = []

        return render json: { message: "there is no ranking" } if all_records == nil
        all_records.each do |record|

          user = record[:user_id]
          unless array.include?(record[:user_id])
            value_km = 0
            all_records.each do |record_data|

SELECT "rankings".* FROM "rankings" WHERE (start_date >= '2023-05-01' OR start_date <= '2023-05-30')
SELECT "records".* FROM "records" WHERE "records"."ranking_id" = $1  [["ranking_id", 1]]
---
      def ranking_filter
        first_date = "#{params[:year]}-#{params[:month]}-01"
        last_date = "#{params[:year]}-#{params[:month]}-30"
        array = []
        data = []

        get_records = Ranking.where("start_date >= ? OR start_date <= ?", first_date, last_date)
        return render json: { message: "there is no ranking" } if get_records == nil

        get_records.each do |ranking|
          all_records = ranking&.records

          all_records.each do |record|

SELECT "rankings".* FROM "rankings" WHERE "rankings"."start_date" = $1 ORDER BY "rankings"."id" ASC LIMIT $2  [["start_date", "2023-05-18"], ["LIMIT", 1]]
INSERT INTO "records" ("user_id", "ranking_id", "km_traveled", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["ranking_id", 2], ["km_traveled", "35.0"], ["created_at", "2023-05-19 00:43:30.195841"], ["updated_at", "2023-05-19 00:43:30.195841"]]
---
      def create_record
        current_date = Date.today.to_s
        ranking = Ranking.where(start_date: current_date).first
        create_record = ranking.records.create!(user_id: params[:id_user], km_traveled: params[:km_traveled])